In [139]:
import pandas as pd

In [140]:
df=pd.read_excel("marketing_data.xlsx")

In [141]:
df

,ï»¿ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country
0,1826,1970,Graduation,Divorced,"$84,835.00",0.0,0,6/16/2014,SP
1,1,1961,Graduation,Single,"$57,091.00",0.0,0,6/15/2014,CA
2,10699,1985,Graduation,Married,"$44,322.00",1.0,0,6/16/2014,SA
3,7516,1983,Graduation,Married,"$30,096.00",1.0,0,5/22/2014,GER
4,3129,1983,Graduation,Married,"$30,096.00",1.0,0,5/22/2014,SP
...,...,...,...,...,...,...,...,...,...
610,10142,1976,PhD,Divorced,"$66,476.00",0.0,1,3/7/2013,US
611,5263,1977,2n Cycle,Married,"$31,056.00",1.0,0,1/22/2013,SP
612,22,1976,Graduation,Divorced,"$46,310.00",1.0,0,12/3/2012,SP
613,528,1978,Graduation,Married,"$65,819.00",0.0,0,11/29/2012,IND
614,4070,1969,PhD,Married,"$94,871.00",0.0,2,9/1/2012,CA

# Boş dəyərlərin tapılması

In [142]:
df.isnull().sum()

ï»¿ID              0
Year_Birth         0
Education          0
Marital_Status     0
 Income           35
Kidhome           44
Teenhome           0
Dt_Customer        0
Country            0
dtype: int64

# Boş deyərləri silinməsi

In [143]:
df.dropna(subset=['Kidhome'], inplace=True)

In [144]:
df.isnull().sum()

ï»¿ID              0
Year_Birth         0
Education          0
Marital_Status     0
 Income           28
Kidhome            0
Teenhome           0
Dt_Customer        0
Country            0
dtype: int64

# Sütun tiplərini kontrol etmək

In [145]:
df.dtypes

ï»¿ID               int64
Year_Birth          int64
Education          object
Marital_Status     object
 Income            object
Kidhome           float64
Teenhome            int64
Dt_Customer        object
Country            object
dtype: object

# Sütundakə dəyərlərin digər dəyərlərlə əvəz edilməsi

In [148]:
df[" Income "]=df[" Income "].str.replace("$","")
df[" Income "]=df[" Income "].str.replace(",","")
df[" Income "]=df[" Income "].str.replace(" ","")
df[" Income "]=df[" Income "].str.replace(".","")

C:\Users\Forum\AppData\Local\Temp\ipykernel_6676\689694942.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df[" Income "]=df[" Income "].str.replace("$","")
C:\Users\Forum\AppData\Local\Temp\ipykernel_6676\689694942.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df[" Income "]=df[" Income "].str.replace(".","")

In [168]:
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country
0,1826,1970,Graduation,Divorced,8483500.0,0.0,0,2014-06-16,SP
1,1,1961,Graduation,Single,5709100.0,0.0,0,2014-06-15,CA
2,10699,1985,Graduation,Married,4432200.0,1.0,0,2014-06-16,SA
3,7516,1983,Graduation,Married,3009600.0,1.0,0,2014-05-22,GER
4,3129,1983,Graduation,Married,3009600.0,1.0,0,2014-05-22,SP

# Sütunun tipinin dəyişdirilməsi

In [157]:
df[" Income "] = pd.to_numeric(df[" Income "])
df["Dt_Customer"]=pd.to_datetime(df["Dt_Customer"])

# Sütunu medianının tapılması

In [158]:
median=df[" Income "].mean()

# Boş dəyərlərin doldurulması

In [161]:

df.fillna(median,inplace=True)

In [162]:
df.isnull().sum()

ï»¿ID             0
Year_Birth        0
Education         0
Marital_Status    0
 Income           0
Kidhome           0
Teenhome          0
Dt_Customer       0
Country           0
dtype: int64

# Sütun adının dəyişdirilməsi

In [166]:
df.rename(columns={"ï»¿ID": "ID"}, inplace=True)

In [167]:
df.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', ' Income ',
       'Kidhome', 'Teenhome', 'Dt_Customer', 'Country'],
      dtype='object')

# Yeni sütun yaratmaq

In [169]:
df["kidhome"]=df.Kidhome.apply(lambda x: str(x).split('.')[0])

In [170]:
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Country,kidhome
0,1826,1970,Graduation,Divorced,8483500.0,0.0,0,2014-06-16,SP,0
1,1,1961,Graduation,Single,5709100.0,0.0,0,2014-06-15,CA,0
2,10699,1985,Graduation,Married,4432200.0,1.0,0,2014-06-16,SA,1
3,7516,1983,Graduation,Married,3009600.0,1.0,0,2014-05-22,GER,1
4,3129,1983,Graduation,Married,3009600.0,1.0,0,2014-05-22,SP,1

# Sütun silmək

In [172]:
df.drop("Kidhome", axis=1, inplace=True)

In [173]:
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Teenhome,Dt_Customer,Country,kidhome
0,1826,1970,Graduation,Divorced,8483500.0,0,2014-06-16,SP,0
1,1,1961,Graduation,Single,5709100.0,0,2014-06-15,CA,0
2,10699,1985,Graduation,Married,4432200.0,0,2014-06-16,SA,1
3,7516,1983,Graduation,Married,3009600.0,0,2014-05-22,GER,1
4,3129,1983,Graduation,Married,3009600.0,0,2014-05-22,SP,1

# Dublikat dəyərləri yoxlamaq

In [185]:
df.duplicated().sum()

0